app/controllers/events_controller.rb

INSERT INTO "events" ("title", "owner", "interested", "attending", "description", "location", "minimum", "maximum", "date", "price", "doodle", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save